clc;
clear;
% 验证将点云换回相机坐标系
% 地面转15度采集IR图，用Dr.Ren标定库计算的外参数
% 第一个状态时的相机外参数
R0 = [[0.0579674027238,  0.935394840597,   0.348821261401];...
      [-0.045268317031,  0.35151223372,    -0.935088193177];...
      [-0.997291612165,  0.0384140824279,  0.0627200014077]];
T0 = [-444.611471496;   1102.04828603;    726.240071575];
% 第二个状态时的相机外参数
R1 = [[0.056744145908, 0.992220799225,   0.110806080568];...
      [-0.0353351267605,  0.112911263177,   -0.992976573472];...
      [-0.997763263867,  0.0524302606656,  0.0414673009074]];
T1 = [-254.418757297;   1174.45053088;    741.28407823];

RC = R0' * R1;
TC = R0' * (T1-T0);

iSensor = 2;
filename1 = ['./pointCloud1/Camera1-ptCloud0', num2str(iSensor),'.asc'];
PT1 = load(filename1);
[M1, N1] = size(PT1);
filenameRT1 = ['./pointCloud1/Camera1-RT-ptCloud0', num2str(iSensor),'.asc'];
fid = fopen(filenameRT1, 'w');
for j = 1 : M1
    % 重建出来的点
    XC1 = PT1(j,1:3);
    % 从第二个相机坐标系换算回世界坐标系
    % C1 = R * C2 + T
    XW1 = R1 * XC1' + T1;
    fprintf(fid, '%f  %f  %f\n', XW1(1,1), XW1(2,1), XW1(3,1));
end
fclose(fid);