clc;
clear;
% 验证将点云换回相机坐标系
% 地面转15度采集IR图，用Dr.Ren标定库计算的外参数
% 第一个状态时的相机外参数
R0 = [[0.0579674027238,  0.935394840597,   0.348821261401];...
      [-0.045268317031,  0.35151223372,    -0.935088193177];...
      [-0.997291612165,  0.0384140824279,  0.0627200014077]];
T0 = [-444.611471496;   1102.04828603;    726.240071575];
% 第二个状态时的相机外参数
R1 = [[0.056744145908, 0.992220799225,   0.110806080568];...
      [-0.0353351267605,  0.112911263177,   -0.992976573472];...
      [-0.997763263867,  0.0524302606656,  0.0414673009074]];
T1 = [-254.418757297;   1174.45053088;    741.28407823];

%PT1_0 = load('./pointCloud1/ptCloud00.asc');
%PT1_1 = load('./pointCloud1/ptCloud01.asc');
PT1_2 = load('./pointCloud1/ptCloud02.asc');
%PT1_3 = load('./pointCloud1/ptCloud03.asc');

%[M0, N0] = size(PT1_0);
%[M1, N1] = size(PT1_1);
[M2, N2] = size(PT1_2);
%[M3, N3] = size(PT1_3);

fid = fopen('./pointCloud1/Camera1-ptCloud02.asc', 'w');
for j = 1 : M2
    % 重建出来的点
    XW = PT1_2(j,1:3);
    % 换算回相机坐标系
    % W = R * C + T
    XC = R0' * (XW' - T0);
    fprintf(fid, '%f  %f  %f\n', XC(1,1), XC(2,1), XC(3,1));
end
fclose(fid);